package algorithms.basis.operations.addition;

/**
 * ------------------------------------------------------------------------------------------------
 * Особенности реализации
 *
 * Для вещественных примитивных типов  точность представления числа ограниченна
 * (формате IEEE 754 с плавающей точкой). Например для double точность до 15 знаков
 * после запятой. Что приводит к элементам несоответствия операций для вещественных
 * типов в Java и в арифметике.
 * ------------------------------------------------------------------------------------------------
 * <a href="https://youtu.be/sT-3BCNvUrw">Ссылка на видео</>
 * ------------------------------------------------------------------------------------------------
 */
public class AdditionInaccuracy {

    public static void main(String[] args) {
        double a = 0.3;
        double b = 0.1;
        double c = a - (b + b + b);
        System.out.println(c); // >> -5.551115123125783E-17
    }
}
